src/src/InformationRegisters/СинтетическиеДанныеПереноса/СинтетическиеДанныеПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинтетическиеДанныеПереноса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Момент</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Флаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Линия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/src/CommonModules/НагрузочныйТест/Module.bsl
#Область ПрограммныйИнтерфейс

// Полный нагрузочный прогон движка ПереносРегистров на синтетическом регистре
// РегистрСведений.СинтетическиеДанныеПереноса: наполнение -> выгрузка -> очистка -> загрузка,
// с замером времени каждого этапа и суммарного размера файлов транспорта.
//
// Папка               - каталог обмена (будет очищен от прежних .bin/manifest при выгрузке).
// КоличествоСтрок      - сколько строк сгенерировать в регистре.
// РазмерПакета         - строк на один НаборЗаписей при наполнении (батч записи).
// РазмерПорцииВыгрузки - строк на одну порцию (.bin) при выгрузке движком.
//
// Возвращает текстовый отчёт с цифрами (время, размер, пропускная способность).
Функция ВыполнитьБенчмарк(Папка, КоличествоСтрок, РазмерПакета = 50000, РазмерПорцииВыгрузки = 100000, ПисатьФайл = Истина) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("=== Нагрузочный тест: %1 строк ===", Формат(КоличествоСтрок, "ЧГ=")));

	// --- Подготовка: файлы транспорта от прежнего размера ---
	ОчиститьФайлыПапки(Папка);

	// --- Этап 1: наполнение (пропускается, если в регистре уже нужное количество) ---
	Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
	СтрокВРегистре = Подготовка.Строк;
	Отчёт.Добавить(СтрокаНаполнения(Подготовка));

	// --- Этап 2: выгрузка движком ---
	НачалоВыгрузки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЛогВыгрузки = Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(СписокРегистра(), Папка, РазмерПорцииВыгрузки);
	МсВыгрузки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыгрузки;
	РазмерБайт = СуммарныйРазмерФайлов(Папка);
	Отчёт.Добавить(СтрШаблон("Выгрузка: %1 (%2 строк/с) | размер %3 (%4 байт/строку)",
		ВремяСтрокой(МсВыгрузки), Пропускная(СтрокВРегистре, МсВыгрузки),
		РазмерСтрокой(РазмерБайт), Формат(?(СтрокВРегистре > 0, РазмерБайт / СтрокВРегистре, 0), "ЧДЦ=1; ЧГ=")));

	// --- Этап 3: очистка перед загрузкой (проверяем, что грузим в пустой) ---
	ОчиститьНагрузочныйРегистр();

	// --- Этап 4: загрузка движком ---
	НачалоЗагрузки = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЛогЗагрузки = Обработки.БыстрыйПереносРегистров.ЗагрузитьРегистры(Папка, Истина);
	МсЗагрузки = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗагрузки;
	СтрокПослеЗагрузки = КоличествоСтрокВРегистре();
	Отчёт.Добавить(СтрШаблон("Загрузка: %1 (%2 строк/с)",
		ВремяСтрокой(МсЗагрузки), Пропускная(СтрокПослеЗагрузки, МсЗагрузки)));

	// --- Контроль целостности round-trip ---
	Сошлось = ?(СтрокПослеЗагрузки = СтрокВРегистре, "OK", "РАСХОЖДЕНИЕ!");
	Отчёт.Добавить(СтрШаблон("Сверка: было %1, стало %2 -> %3",
		Формат(СтрокВРегистре, "ЧГ="), Формат(СтрокПослеЗагрузки, "ЧГ="), Сошлось));

	Отчёт.Добавить("--- лог выгрузки ---");
	Отчёт.Добавить(ЛогВыгрузки);
	Отчёт.Добавить("--- лог загрузки ---");
	Отчёт.Добавить(ЛогЗагрузки);

	ТекстОтчёта = СтрСоединить(Отчёт, Символы.ПС);
	// Дублируем отчёт в файл рядом с транспортом - удобно забрать цифры с диска.
	// При прогоне серии файл пишет ВыполнитьСерию (нарастающим итогом), поэтому здесь не дублируем.
	Если ПисатьФайл Тогда
		ЗаписатьОтчётВФайл(Папка, ТекстОтчёта);
	КонецЕсли;
	Возврат ТекстОтчёта;

КонецФункции

// Серия нагрузочных прогонов по списку размеров (кривая масштабирования) одним вызовом.
// Отчёт пишется в файл НАРАСТАЮЩИМ итогом после каждого размера - частичные результаты
// переживут обрыв веб-клиента на длинном прогоне.
Функция ВыполнитьСерию(Папка, МассивРазмеров, РазмерПакета = 50000, РазмерПорцииВыгрузки = 100000) Экспорт

	Накопитель = Новый Массив;
	Накопитель.Добавить("###### СЕРИЯ НАГРУЗОЧНЫХ ТЕСТОВ ######");

	Для Каждого Размер Из МассивРазмеров Цикл
		Текст = ВыполнитьБенчмарк(Папка, Размер, РазмерПакета, РазмерПорцииВыгрузки, Ложь);
		Накопитель.Добавить(Текст);
		Накопитель.Добавить("");
		ЗаписатьОтчётВФайл(Папка, СтрСоединить(Накопитель, Символы.ПС));
	КонецЦикла;

	Возврат СтрСоединить(Накопитель, Символы.ПС);

КонецФункции

// Генерирует КоличествоСтрок записей в РегистрСведений.СинтетическиеДанныеПереноса пакетами.
// Возвращает число фактически записанных строк.
Функция ЗаполнитьНагрузочныйРегистр(КоличествоСтрок, РазмерПакета = 50000) Экспорт

	Если РазмерПакета < 1 Тогда
		РазмерПакета = 50000;
	КонецЕсли;

	БазоваяДата = Дата(2026, 1, 1);
	Записано = 0;
	Линия = 0;

	Пока Линия < КоличествоСтрок Цикл
		НаборЗаписей = РегистрыСведений.СинтетическиеДанныеПереноса.СоздатьНаборЗаписей();
		// ЗАР: режим обмена отключает проверки/события платформы - быстрый batch insert.
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		СтрокВПакете = 0;
		Пока СтрокВПакете < РазмерПакета И Линия < КоличествоСтрок Цикл
			Линия = Линия + 1;
			Запись = НаборЗаписей.Добавить();
			Запись.Линия = Линия;
			Запись.Сумма = Линия * 1.5;
			Запись.Количество = Линия % 1000 + 1;
			Запись.Текст = "Запись нагрузочного теста " + Формат(Линия, "ЧГ=");
			Запись.Момент = БазоваяДата + Линия;
			Запись.Флаг = (Линия % 2 = 0);
			СтрокВПакете = СтрокВПакете + 1;
		КонецЦикла;

		// ЗАР: независимый РС - дозапись Записать(Ложь). Пустой отбор + замещение затёр бы
		// предыдущие пакеты; ключ Линия уникален, поэтому коллизий при дозаписи нет.
		НаборЗаписей.Записать(Ложь);
		Записано = Записано + СтрокВПакете;
	КонецЦикла;

	Возврат Записано;

КонецФункции

// Полностью очищает РегистрСведений.СинтетическиеДанныеПереноса.
Процедура ОчиститьНагрузочныйРегистр() Экспорт

	НаборЗаписей = РегистрыСведений.СинтетическиеДанныеПереноса.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	// Пустой отбор + запись с замещением = очистка всего регистра.
	НаборЗаписей.Записать();

КонецПроцедуры

// Бенчмарк ПАРАЛЛЕЛЬНОЙ выгрузки движком ПереносРегистров: наполняет регистр один раз,
// затем выгружает его при N из СписокПотоков (1,2,4,8) и сравнивает время + ускорение.
// Отчёт пишется нарастающим итогом в benchmark_parallel.txt.
//
// ЗАР: вопреки расхожему мнению, в ФАЙЛОВОЙ ИБ фоновые задания на ЧТЕНИИ реально идут
// параллельно, но ускорение быстро выходит на плато: предел задаёт не число ядер, а
// read-lock файловой СУБД и дисковый I/O. На клиент-серверной ИБ потолок выше.
Функция ВыполнитьПараллельныйБенчмарк(Папка, КоличествоСтрок, РазмерПакета = 50000, РазмерПорции = 100000) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("###### ПАРАЛЛЕЛЬНАЯ ВЫГРУЗКА: %1 строк ######", Формат(КоличествоСтрок, "ЧГ=")));

	// Наполняем регистр один раз (или пропускаем, если уже наполнен) - дальше только выгрузка.
	Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
	СтрокВРегистре = Подготовка.Строк;
	Отчёт.Добавить(СтрокаНаполнения(Подготовка));

	БазовоеМс = 0;
	Для Каждого ЧислоПотоков Из СписокПотоков() Цикл
		Замер = ЗамерПараллельнойВыгрузки(Папка, ЧислоПотоков, РазмерПорции);
		Если ЧислоПотоков = 1 Тогда
			БазовоеМс = Замер.Мс;
		КонецЕсли;
		Ускорение = ?(Замер.Мс > 0, Формат(БазовоеМс / Замер.Мс, "ЧДЦ=2"), "-");
		Строка = СтрШаблон("%1 поток(ов): %2 (%3 строк/с), ускорение x%4, файлов %5",
			Формат(ЧислоПотоков, "ЧГ="), ВремяСтрокой(Замер.Мс),
			Пропускная(СтрокВРегистре, Замер.Мс), Ускорение, Формат(Замер.Файлов, "ЧГ="));
		Если НЕ ПустаяСтрока(Замер.Ошибки) Тогда
			Строка = Строка + " [ОШИБКИ: " + Замер.Ошибки + "]";
		КонецЕсли;
		Отчёт.Добавить(Строка);
		ЗаписатьОтчётВФайлИмя(Папка, "benchmark_parallel.txt", СтрСоединить(Отчёт, Символы.ПС));
	КонецЦикла;

	Возврат СтрСоединить(Отчёт, Символы.ПС);

КонецФункции

// Бенчмарк ПАРАЛЛЕЛЬНОЙ загрузки движком: один раз готовит файлы (наполнить + выгрузить),
// затем грузит их при N из СписокПотоков (1,2,4,8), сравнивая время/ускорение и сверяя
// число строк (round-trip). Отчёт нарастающим итогом в benchmark_load.txt.
Функция ВыполнитьБенчмаркЗагрузки(Папка, КоличествоСтрок, РазмерПакета = 50000, РазмерПорции = 100000) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("###### ПАРАЛЛЕЛЬНАЯ ЗАГРУЗКА: %1 строк ######", Формат(КоличествоСтрок, "ЧГ=")));

	// Готовим файлы один раз: наполняем (или пропускаем) и выгружаем параллельно.
	Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
	СтрокИсходно = Подготовка.Строк;
	Отчёт.Добавить(СтрокаНаполнения(Подготовка));
	ОчиститьФайлыПапки(Папка);
	Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(СписокРегистра(), Папка, РазмерПорции, 4);
	Отчёт.Добавить(СтрШаблон("Подготовка: выгружено %1 строк", Формат(СтрокИсходно, "ЧГ=")));

	БазовоеМс = 0;
	Для Каждого ЧислоПотоков Из СписокПотоков() Цикл
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ЗагрузитьРегистры(Папка, Истина, ЧислоПотоков);
		Мс = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		Загружено = КоличествоСтрокВРегистре();
		Если ЧислоПотоков = 1 Тогда
			БазовоеМс = Мс;
		КонецЕсли;
		Ускорение = ?(Мс > 0, Формат(БазовоеМс / Мс, "ЧДЦ=2"), "-");
		Сошлось = ?(Загружено = СтрокИсходно, "OK", "РАСХОЖДЕНИЕ!");
		Отчёт.Добавить(СтрШаблон("%1 поток(ов): %2 (%3 строк/с), ускорение x%4, загружено %5 [%6]",
			Формат(ЧислоПотоков, "ЧГ="), ВремяСтрокой(Мс), Пропускная(Загружено, Мс),
			Ускорение, Формат(Загружено, "ЧГ="), Сошлось));
		ЗаписатьОтчётВФайлИмя(Папка, "benchmark_load.txt", СтрСоединить(Отчёт, Символы.ПС));
	КонецЦикла;

	Возврат СтрСоединить(Отчёт, Символы.ПС);

КонецФункции

// Проверка упаковки: ТЗ -> файл НАПРЯМУЮ (вариант A, как в движке) против
// ТЗ -> ХранилищеЗначения -> файл (вариант B, сжатие по умолчанию = оптимальное).
// Меряет время записи, размер файлов и время чтения обоих вариантов + round-trip.
// ТЗ строится в памяти порциями (регистр не нужен - быстрее и самодостаточно).
Функция ВыполнитьБенчмаркУпаковки(Папка, КоличествоСтрок, РазмерПорции = 100000) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("###### УПАКОВКА: ТЗ напрямую (A) vs ХранилищеЗначения (B), %1 строк ######",
		Формат(КоличествоСтрок, "ЧГ=")));

	ОчиститьФайлыПапки(Папка);

	БазоваяДата = Дата(2026, 1, 1);
	ВремяA = 0; РазмерA = 0;
	ВремяB = 0; РазмерB = 0;
	ВремяC = 0; РазмерC = 0;
	ЧислоПорций = 0;
	Линия = 0;
	ТЗ = НовыйШаблонТЗ();

	Пока Линия < КоличествоСтрок Цикл
		Линия = Линия + 1;
		Строка = ТЗ.Добавить();
		Строка.Линия = Линия;
		Строка.Сумма = Линия * 1.5;
		Строка.Количество = Линия % 1000 + 1;
		Строка.Текст = "Запись нагрузочного теста " + Формат(Линия, "ЧГ=");
		Строка.Момент = БазоваяДата + Линия;
		Строка.Флаг = (Линия % 2 = 0);

		Если ТЗ.Количество() >= РазмерПорции Тогда
			Замер = ОбработатьПорциюУпаковки(Папка, ЧислоПорций, ТЗ);
			ВремяA = ВремяA + Замер.МсA; РазмерA = РазмерA + Замер.БайтA;
			ВремяB = ВремяB + Замер.МсB; РазмерB = РазмерB + Замер.БайтB;
			ВремяC = ВремяC + Замер.МсC; РазмерC = РазмерC + Замер.БайтC;
			ЧислоПорций = ЧислоПорций + 1;
			ТЗ.Очистить();
		КонецЕсли;
	КонецЦикла;
	Если ТЗ.Количество() > 0 Тогда
		Замер = ОбработатьПорциюУпаковки(Папка, ЧислоПорций, ТЗ);
		ВремяA = ВремяA + Замер.МсA; РазмерA = РазмерA + Замер.БайтA;
		ВремяB = ВремяB + Замер.МсB; РазмерB = РазмерB + Замер.БайтB;
		ВремяC = ВремяC + Замер.МсC; РазмерC = РазмерC + Замер.БайтC;
		ЧислоПорций = ЧислоПорций + 1;
	КонецЕсли;

	ЧтениеA = ЗамерЧтения(Папка, "pack_A_", ЧислоПорций, Ложь);
	ЧтениеB = ЗамерЧтения(Папка, "pack_B_", ЧислоПорций, Истина);
	ЧтениеC = ЗамерЧтения(Папка, "pack_C_", ЧислоПорций, Истина);

	Отчёт.Добавить(СтрШаблон("A (напрямую):        запись %1, размер %2, чтение %3",
		ВремяСтрокой(ВремяA), РазмерСтрокой(РазмерA), ВремяСтрокой(ЧтениеA.Мс)));
	Отчёт.Добавить(СтрШаблон("B (ХЗ без сжатия):   запись %1, размер %2, чтение %3",
		ВремяСтрокой(ВремяB), РазмерСтрокой(РазмерB), ВремяСтрокой(ЧтениеB.Мс)));
	Отчёт.Добавить(СтрШаблон("C (ХЗ deflate=9):    запись %1, размер %2, чтение %3",
		ВремяСтрокой(ВремяC), РазмерСтрокой(РазмерC), ВремяСтрокой(ЧтениеC.Мс)));
	Отчёт.Добавить(СтрШаблон("Размер: B/A %1%%, C/A %2%% (C экономит %3 vs A)",
		Формат(?(РазмерA > 0, 100 * РазмерB / РазмерA, 0), "ЧДЦ=1"),
		Формат(?(РазмерA > 0, 100 * РазмерC / РазмерA, 0), "ЧДЦ=1"),
		РазмерСтрокой(?(РазмерA > РазмерC, РазмерA - РазмерC, 0))));
	Отчёт.Добавить(СтрШаблон("Цена C: запись x%1, чтение x%2 (относительно A)",
		Формат(?(ВремяA > 0, ВремяC / ВремяA, 0), "ЧДЦ=2"),
		Формат(?(ЧтениеA.Мс > 0, ЧтениеC.Мс / ЧтениеA.Мс, 0), "ЧДЦ=2")));
	Сошлось = ?(ЧтениеA.Строк = КоличествоСтрок И ЧтениеB.Строк = КоличествоСтрок
		И ЧтениеC.Строк = КоличествоСтрок, "OK", "РАСХОЖДЕНИЕ!");
	Отчёт.Добавить(СтрШаблон("Round-trip: A %1, B %2, C %3 строк -> %4",
		Формат(ЧтениеA.Строк, "ЧГ="), Формат(ЧтениеB.Строк, "ЧГ="),
		Формат(ЧтениеC.Строк, "ЧГ="), Сошлось));

	ТекстОтчёта = СтрСоединить(Отчёт, Символы.ПС);
	ЗаписатьОтчётВФайлИмя(Папка, "benchmark_pack.txt", ТекстОтчёта);
	Возврат ТекстОтчёта;

КонецФункции

// Подбор размера порции (чанка): наполняет регистр один раз, затем выгружает его движком
// (1 поток, без сжатия) при разных РазмерПорции и ищет самый быстрый - его и брать дефолтом.
Функция ВыполнитьБенчмаркЧанка(Папка, КоличествоСтрок, РазмерПакета = 50000) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("###### ПОДБОР ЧАНКА: %1 строк ######", Формат(КоличествоСтрок, "ЧГ=")));

	Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
	СтрокВсего = Подготовка.Строк;
	Отчёт.Добавить(СтрокаНаполнения(Подготовка));

	ЛучшийМс = 0;
	ЛучшийЧанк = 0;
	Для Каждого Чанк Из СписокЧанков() Цикл
		ОчиститьФайлыПапки(Папка);
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(СписокРегистра(), Папка, Чанк, 1, 0);
		Мс = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		Файлов = НайтиФайлы(Папка, "*.bin").Количество();
		Если ЛучшийМс = 0 ИЛИ Мс < ЛучшийМс Тогда
			ЛучшийМс = Мс;
			ЛучшийЧанк = Чанк;
		КонецЕсли;
		Отчёт.Добавить(СтрШаблон("чанк %1: %2 (%3 строк/с), файлов %4",
			Формат(Чанк, "ЧГ="), ВремяСтрокой(Мс), Пропускная(СтрокВсего, Мс), Формат(Файлов, "ЧГ=")));
		ЗаписатьОтчётВФайлИмя(Папка, "benchmark_chunk.txt", СтрСоединить(Отчёт, Символы.ПС));
	КонецЦикла;

	Отчёт.Добавить(СтрШаблон("ЛУЧШИЙ ЧАНК: %1 (%2)", Формат(ЛучшийЧанк, "ЧГ="), ВремяСтрокой(ЛучшийМс)));
	ТекстОтчёта = СтрСоединить(Отчёт, Символы.ПС);
	ЗаписатьОтчётВФайлИмя(Папка, "benchmark_chunk.txt", ТекстОтчёта);
	Возврат ТекстОтчёта;

КонецФункции

// Осмысленный ПОЛНЫЙ тест переноса выбранного регистра. Возвращает HTML-отчёт с таблицей показателей.
//
// СИНТЕТИЧЕСКИЙ регистр (ИмяРегистра = ИмяСинтетическогоРегистра): полный round-trip -
//   наполнение (при необходимости) -> выгрузка (1 и N потоков) -> очистка -> загрузка -> сверка.
// РЕАЛЬНЫЙ регистр: данные НЕ изменяются - только выгрузка (чтение) в 1 и N потоков; очистка и
//   загрузка ПРОПУСКАЮТСЯ (чтобы не разрушить рабочие данные). Наполнение не требуется.
Функция ПолныйТест(Папка, ИмяРегистра, КоличествоСтрок = 5000000, РазмерПакета = 50000,
		РазмерПорции = 100000, ЧислоПотоков = 4, Сжатие = 0, ФорматДанных = 0) Экспорт

	ЭтоСинтетический = (СокрЛП(ИмяРегистра) = ИмяСинтетическогоРегистра());
	Метрики = Новый Массив;

	Если ПолноеИмяРегистра(СокрЛП(ИмяРегистра)) = "" Тогда
		Возврат СформироватьHTMLОтчёт("Полный тест", Метрики, "Регистр не найден: " + ИмяРегистра);
	КонецЕсли;

	// --- Подготовка ---
	Если ЭтоСинтетический Тогда
		Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
		ДобавитьМетрику(Метрики, "Регистр", ИмяРегистра + " (синтетический, round-trip)");
		ДобавитьМетрику(Метрики, "Наполнение", ?(Подготовка.Заполнялось, ВремяСтрокой(Подготовка.Мс), "пропущено (уже наполнен)"));
		Строк = Подготовка.Строк;
	Иначе
		Строк = КоличествоПоРегистру(СокрЛП(ИмяРегистра));
		ДобавитьМетрику(Метрики, "Регистр", ИмяРегистра + " (реальный, данные не изменяются)");
	КонецЕсли;
	ДобавитьМетрику(Метрики, "Строк в регистре", Формат(Строк, "ЧГ="));
	ДобавитьМетрику(Метрики, "Сжатие", ?(Сжатие > 0, "deflate " + Формат(Сжатие, "ЧГ="), "выкл (напрямую)"));
	ДобавитьМетрику(Метрики, "Формат чанков", ?(ФорматДанных = 1, "JSON (портативный, 1 поток)", "бинарный (.bin)"));

	Если Строк = 0 Тогда
		Возврат СформироватьHTMLОтчёт("Полный тест: " + ИмяРегистра, Метрики, "Регистр пуст - переносить нечего.");
	КонецЕсли;

	Регистры = Новый Массив;
	Регистры.Добавить(СокрЛП(ИмяРегистра));

	// --- Выгрузка в 1 поток ---
	ОчиститьФайлыПапки(Папка);
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(Регистры, Папка, РазмерПорции, 1, Сжатие, ФорматДанных);
	Мс1 = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	РазмерБайт = СуммарныйРазмерФайлов(Папка);
	ДобавитьМетрику(Метрики, "Выгрузка, 1 поток", ВремяСтрокой(Мс1) + " · " + Пропускная(Строк, Мс1) + " строк/с");
	ДобавитьМетрику(Метрики, "Размер транспорта", РазмерСтрокой(РазмерБайт)
		+ " · " + Формат(?(Строк > 0, РазмерБайт / Строк, 0), "ЧДЦ=1") + " байт/строку");

	// --- Выгрузка в N потоков ---
	Если ЧислоПотоков > 1 Тогда
		ОчиститьФайлыПапки(Папка);
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(Регистры, Папка, РазмерПорции, ЧислоПотоков, Сжатие, ФорматДанных);
		МсN = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		ДобавитьМетрику(Метрики, СтрШаблон("Выгрузка, %1 потоков", Формат(ЧислоПотоков, "ЧГ=")),
			ВремяСтрокой(МсN) + " · " + Пропускная(Строк, МсN) + " строк/с · ускорение x"
			+ ?(МсN > 0, Формат(Мс1 / МсN, "ЧДЦ=2"), "-"));
	КонецЕсли;

	// --- Загрузка (round-trip) - ТОЛЬКО для синтетического (реальный не трогаем) ---
	Если ЭтоСинтетический Тогда
		ОчиститьНагрузочныйРегистр();
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ЗагрузитьРегистры(Папка, Истина, ЧислоПотоков);
		МсЗагр = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		СтрокПосле = КоличествоПоРегистру(ИмяСинтетическогоРегистра());
		ДобавитьМетрику(Метрики, СтрШаблон("Загрузка, %1 потоков", Формат(ЧислоПотоков, "ЧГ=")),
			ВремяСтрокой(МсЗагр) + " · " + Пропускная(СтрокПосле, МсЗагр) + " строк/с");
		ДобавитьМетрику(Метрики, "Round-trip сверка",
			?(СтрокПосле = Строк, "OK (" + Формат(Строк, "ЧГ=") + ")", "РАСХОЖДЕНИЕ: " + Формат(СтрокПосле, "ЧГ=")));
	Иначе
		ДобавитьМетрику(Метрики, "Загрузка", "пропущена (реальный регистр - данные защищены)");
	КонецЕсли;

	HTML = СформироватьHTMLОтчёт("Полный тест переноса: " + ИмяРегистра, Метрики, "");
	ЗаписатьОтчётВФайлИмя(Папка, "full_test_report.html", HTML);
	Возврат HTML;

КонецФункции

// Матрица форматов транспорта: bin / bin+deflate9 / json на одном объёме, полный round-trip
// на каждый вариант («симпатичный план» сравнения форматов для разных сред - профиль среды
// пишет форма в шапку отчёта). Отчёт нарастающим итогом: benchmark_format.txt + benchmark_format.prom.
Функция ВыполнитьМатрицуФормата(Папка, КоличествоСтрок, РазмерПакета = 50000, РазмерПорции = 100000) Экспорт

	Отчёт = Новый Массив;
	Отчёт.Добавить(СтрШаблон("###### МАТРИЦА ФОРМАТОВ: %1 строк ######", Формат(КоличествоСтрок, "ЧГ=")));

	Подготовка = НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета);
	СтрокИсходно = Подготовка.Строк;
	Отчёт.Добавить(СтрокаНаполнения(Подготовка));

	Пром = Новый Массив;
	Пром.Добавить("# Матрица форматов транспорта: последний прогон");
	Пром.Добавить("# TYPE bpr_format_dump_seconds gauge");
	Пром.Добавить("# TYPE bpr_format_load_seconds gauge");
	Пром.Добавить("# TYPE bpr_format_bytes gauge");

	Варианты = Новый Массив;
	Варианты.Добавить(Новый Структура("Имя, Формат, Сжатие", "bin", 0, 0));
	Варианты.Добавить(Новый Структура("Имя, Формат, Сжатие", "bin+deflate9", 0, 9));
	Варианты.Добавить(Новый Структура("Имя, Формат, Сжатие", "json", 1, 0));

	Для Каждого Вариант Из Варианты Цикл
		ОчиститьФайлыПапки(Папка);

		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(СписокРегистра(), Папка, РазмерПорции, 1,
			Вариант.Сжатие, Вариант.Формат);
		МсВыгрузки = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		Байт = СуммарныйРазмерФайлов(Папка);

		ОчиститьНагрузочныйРегистр();
		Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Обработки.БыстрыйПереносРегистров.ЗагрузитьРегистры(Папка, Истина, 1);
		МсЗагрузки = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
		Загружено = КоличествоСтрокВРегистре();

		Сошлось = ?(Загружено = СтрокИсходно, "OK", "РАСХОЖДЕНИЕ!");
		Отчёт.Добавить(СтрШаблон("%1: выгрузка %2 (%3 стр/с) | размер %4 (%5 байт/строку) | загрузка %6 (%7 стр/с) | сверка %8",
			Вариант.Имя, ВремяСтрокой(МсВыгрузки), Пропускная(СтрокИсходно, МсВыгрузки),
			РазмерСтрокой(Байт), Формат(?(СтрокИсходно > 0, Байт / СтрокИсходно, 0), "ЧДЦ=1"),
			ВремяСтрокой(МсЗагрузки), Пропускная(Загружено, МсЗагрузки), Сошлось));

		Метка = "{variant=""" + Вариант.Имя + """}";
		Пром.Добавить("bpr_format_dump_seconds" + Метка + " "
			+ Обработки.БыстрыйПереносРегистров.ПромЧисло(МсВыгрузки / 1000, 3));
		Пром.Добавить("bpr_format_load_seconds" + Метка + " "
			+ Обработки.БыстрыйПереносРегистров.ПромЧисло(МсЗагрузки / 1000, 3));
		Пром.Добавить("bpr_format_bytes" + Метка + " "
			+ Обработки.БыстрыйПереносРегистров.ПромЧисло(Байт, 0));

		// Нарастающий итог после каждого варианта - частичный результат переживёт обрыв.
		ЗаписатьОтчётВФайлИмя(Папка, "benchmark_format.txt", СтрСоединить(Отчёт, Символы.ПС));
		Обработки.БыстрыйПереносРегистров.ЗаписатьПромФайл(Папка, "benchmark_format.prom", Пром);
	КонецЦикла;

	Возврат СтрСоединить(Отчёт, Символы.ПС);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// === Тест подчинённого регистра (РН/РБ): ловит баг расщепления движений регистратора между порциями ===
// Создаёт документы-регистраторы с движениями так, что регистратор ЗАВЕДОМО пересекает границу порции
// (РазмерПорции мал), round-trip'ит и сверяет количество движений ПО КАЖДОМУ регистратору.
Функция ПолныйТестПодчинённого(Папка, КолРегистраторов = 25, СтрокНаРегистратор = 7, РазмерПорции = 10) Экспорт

	ИмяРег = "ТоварыОрганизаций";
	Метрики = Новый Массив;

	Создано = НаполнитьПодчинённыйТест(ИмяРег, КолРегистраторов, СтрокНаРегистратор);

	СнимокДо = СнимокПоРегистраторам(ИмяРег);
	СтрокДо = ИтогоДвижений(СнимокДо);

	Регистры = Новый Массив;
	Регистры.Добавить(ИмяРег);
	Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(Регистры, Папка, РазмерПорции, 1, 0);
	Обработки.БыстрыйПереносРегистров.ЗагрузитьРегистры(Папка, Истина, 1);

	СнимокПосле = СнимокПоРегистраторам(ИмяРег);
	СтрокПосле = ИтогоДвижений(СнимокПосле);

	Расхождений = 0;
	Для Каждого КЗ Из СнимокДо Цикл
		Если СнимокПосле[КЗ.Ключ] <> КЗ.Значение Тогда
			Расхождений = Расхождений + 1;
		КонецЕсли;
	КонецЦикла;
	Расхождений = Расхождений + (СнимокПосле.Количество() - СнимокДо.Количество());

	ДобавитьМетрику(Метрики, "Регистр", ИмяРег + " (подчинённый регистратору, round-trip)");
	ДобавитьМетрику(Метрики, "Создано тест-регистраторов", Формат(Создано, "ЧГ="));
	ДобавитьМетрику(Метрики, "Строк на регистратор", Формат(СтрокНаРегистратор, "ЧГ="));
	ДобавитьМетрику(Метрики, "Размер порции", Формат(РазмерПорции, "ЧГ=") + " (движения регистратора рвутся границей порции)");
	ДобавитьМетрику(Метрики, "Регистраторов в регистре", Формат(СнимокДо.Количество(), "ЧГ="));
	ДобавитьМетрику(Метрики, "Движений до / после", Формат(СтрокДо, "ЧГ=") + " / " + Формат(СтрокПосле, "ЧГ="));
	Вердикт = ?(Расхождений = 0 И СтрокДо = СтрокПосле,
		"OK — " + Формат(СтрокДо, "ЧГ=") + " движений, совпало по всем " + Формат(СнимокДо.Количество(), "ЧГ=") + " регистраторам",
		"FAIL — расхождений по регистраторам: " + Формат(Расхождений, "ЧГ="));
	ДобавитьМетрику(Метрики, "Сверка по регистраторам", Вердикт);

	HTML = СформироватьHTMLОтчёт("Тест подчинённого регистра: " + ИмяРег, Метрики, "");
	ЗаписатьОтчётВФайлИмя(Папка, "subordinate_test_report.html", HTML);
	Возврат HTML;

КонецФункции

Функция НаполнитьПодчинённыйТест(ИмяРег, КолРегистраторов, СтрокНаРегистратор)
	Менеджер = РегистрыНакопления[ИмяРег];
	Создано = 0;
	Для н = 1 По КолРегистраторов Цикл
		Док = Документы.ПоступлениеТоваров.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Записать(РежимЗаписиДокумента.Запись);
		Набор = Менеджер.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Док.Ссылка);
		Для с = 1 По СтрокНаРегистратор Цикл
			Зап = Набор.Добавить();
			Зап.Период = Док.Дата;
			Зап.Регистратор = Док.Ссылка;
			Зап.ВидДвижения = ВидДвиженияНакопления.Приход;
			Зап.Количество = с;
		КонецЦикла;
		Набор.Записать();
		Создано = Создано + 1;
	КонецЦикла;
	Возврат Создано;
КонецФункции

Функция СнимокПоРегистраторам(ИмяРег)
	Запрос = Новый Запрос("ВЫБРАТЬ Регистратор КАК Р, КОЛИЧЕСТВО(*) КАК К ИЗ РегистрНакопления." + ИмяРег + " КАК Т СГРУППИРОВАТЬ ПО Регистратор");
	Выборка = Запрос.Выполнить().Выбрать();
	Соот = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Соот.Вставить(Выборка.Р, Выборка.К);
	КонецЦикла;
	Возврат Соот;
КонецФункции

Функция ИтогоДвижений(Снимок)
	Итог = 0;
	Для Каждого КЗ Из Снимок Цикл
		Итог = Итог + КЗ.Значение;
	КонецЦикла;
	Возврат Итог;
КонецФункции

Функция СписокРегистра()
	Массив = Новый Массив;
	Массив.Добавить(ИмяСинтетическогоРегистра());
	Возврат Массив;
КонецФункции

// Имя синтетического регистра-фикстуры (наполнение/round-trip работают только с ним).
Функция ИмяСинтетическогоРегистра() Экспорт
	Возврат "СинтетическиеДанныеПереноса";
КонецФункции

// Полное имя регистра по короткому (для произвольного регистра-цели полного теста).
Функция ПолноеИмяРегистра(Имя)
	Если Метаданные.РегистрыСведений.Найти(Имя) <> Неопределено Тогда
		Возврат "РегистрСведений." + Имя;
	ИначеЕсли Метаданные.РегистрыНакопления.Найти(Имя) <> Неопределено Тогда
		Возврат "РегистрНакопления." + Имя;
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(Имя) <> Неопределено Тогда
		Возврат "РегистрБухгалтерии." + Имя;
	КонецЕсли;
	Возврат "";
КонецФункции

// Количество строк в произвольном регистре по короткому имени.
Функция КоличествоПоРегистру(Имя)
	ПолноеИмя = ПолноеИмяРегистра(Имя);
	Если ПустаяСтрока(ПолноеИмя) Тогда
		Возврат -1; // регистр не найден
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Кол ИЗ " + ПолноеИмя + " КАК Т");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Кол;
КонецФункции

Процедура ДобавитьМетрику(Метрики, Показатель, Значение)
	Метрики.Добавить(Новый Структура("Показатель, Значение", Показатель, Строка(Значение)));
КонецПроцедуры

Функция ЭкранированиеHTML(Текст)
	Результат = СтрЗаменить(Текст, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Возврат Результат;
КонецФункции

// Собирает HTML-отчёт: заголовок + таблица показателей (+ примечание).
Функция СформироватьHTMLОтчёт(Заголовок, Метрики, Примечание)
	Стр = Новый Массив;
	Стр.Добавить("<html><head><meta charset='utf-8'><style>"
		+ "body{font-family:'Segoe UI',Arial,sans-serif;font-size:13px;margin:8px;}"
		+ "h3{margin:4px 0 10px 0;}"
		+ "table{border-collapse:collapse;}"
		+ "td,th{border:1px solid #c8c8c8;padding:5px 12px;text-align:left;}"
		+ "th{background:#f2f2f2;} tr:nth-child(even){background:#fafafa;}"
		+ ".v{font-weight:600;color:#1a5fb4;}"
		+ "</style></head><body>");
	Стр.Добавить("<h3>" + ЭкранированиеHTML(Заголовок) + "</h3>");
	Стр.Добавить("<table><tr><th>Показатель</th><th>Значение</th></tr>");
	Для Каждого М Из Метрики Цикл
		Стр.Добавить("<tr><td>" + ЭкранированиеHTML(М.Показатель)
			+ "</td><td class='v'>" + ЭкранированиеHTML(М.Значение) + "</td></tr>");
	КонецЦикла;
	Стр.Добавить("</table>");
	Если НЕ ПустаяСтрока(Примечание) Тогда
		Стр.Добавить("<p>" + ЭкранированиеHTML(Примечание) + "</p>");
	КонецЕсли;
	Стр.Добавить("</body></html>");
	Возврат СтрСоединить(Стр, Символы.ПС);
КонецФункции

// Оборачивает обычный текстовый отчёт в HTML (моноширинный <pre>) - чтобы и старые
// кнопки выдавали результат в HTML-поле, а не в однострочное (нарушение стандартов).
Функция ТекстКакHTML(Текст) Экспорт
	Возврат "<html><head><meta charset='utf-8'></head><body>"
		+ "<pre style=""font-family:Consolas,'Courier New',monospace;font-size:12px;"
		+ "white-space:pre-wrap;"">" + ЭкранированиеHTML(Текст) + "</pre></body></html>";
КонецФункции

Функция КоличествоСтрокВРегистре()
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Кол ИЗ РегистрСведений.СинтетическиеДанныеПереноса");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Кол;
КонецФункции

// Наполняет регистр до КоличествоСтрок. Если в регистре УЖЕ ровно столько строк - наполнение
// ПРОПУСКАЕТСЯ (повторные прогоны не тратят время на пересоздание тех же данных).
// Возвращает структуру (Заполнялось - Булево, Мс - время наполнения, Строк - итог в регистре).
Функция НаполнитьЕслиНужно(КоличествоСтрок, РазмерПакета)
	Если КоличествоСтрокВРегистре() = КоличествоСтрок Тогда
		Возврат Новый Структура("Заполнялось, Мс, Строк", Ложь, 0, КоличествоСтрок);
	КонецЕсли;
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОчиститьНагрузочныйРегистр();
	ЗаполнитьНагрузочныйРегистр(КоличествоСтрок, РазмерПакета);
	Мс = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	Возврат Новый Структура("Заполнялось, Мс, Строк", Истина, Мс, КоличествоСтрокВРегистре());
КонецФункции

// Единая строка отчёта про этап наполнения (наполнено за время / пропущено).
Функция СтрокаНаполнения(Подготовка)
	Если Подготовка.Заполнялось Тогда
		Возврат СтрШаблон("Наполнение: %1 строк за %2 (%3 строк/с)",
			Формат(Подготовка.Строк, "ЧГ="), ВремяСтрокой(Подготовка.Мс), Пропускная(Подготовка.Строк, Подготовка.Мс));
	КонецЕсли;
	Возврат СтрШаблон("Наполнение: ПРОПУЩЕНО (в регистре уже %1 строк)", Формат(Подготовка.Строк, "ЧГ="));
КонецФункции

// Удаляет файлы транспорта (.bin/.json чанки + manifest + служебные) - чтобы размер
// считался строго по текущему прогону.
Процедура ОчиститьФайлыПапки(Папка)
	Попытка
		Для Каждого Шаблон Из СтрРазделить("*.bin,*.json", ",") Цикл
			Для Каждого Файл Из НайтиФайлы(Папка, Шаблон) Цикл
				Если Файл.ЭтоФайл() Тогда
					УдалитьФайлы(Файл.ПолноеИмя);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Исключение
		// Не критично - худшее последствие неточный подсчёт размера при коллизии имён.
	КонецПопытки;
КонецПроцедуры

// Сумма размеров файлов транспорта (чанки .bin/.json + manifest) в папке, байт.
// Служебные файлы прогресса ("_*") не считаем - они не транспорт.
Функция СуммарныйРазмерФайлов(Папка)
	Всего = 0;
	Для Каждого Шаблон Из СтрРазделить("*.bin,*.json", ",") Цикл
		Для Каждого Файл Из НайтиФайлы(Папка, Шаблон) Цикл
			Если Файл.ЭтоФайл() И НЕ СтрНачинаетсяС(Файл.Имя, "_") Тогда
				Всего = Всего + Файл.Размер();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Всего;
КонецФункции

Функция Пропускная(Строк, Мс)
	Если Мс <= 0 Тогда
		Возврат "-";
	КонецЕсли;
	Возврат Формат(Строк / (Мс / 1000), "ЧГ=; ЧДЦ=0");
КонецФункции

Функция ВремяСтрокой(Мс)
	Если Мс < 1000 Тогда
		Возврат Формат(Мс, "ЧГ=") + " мс";
	КонецЕсли;
	Возврат Формат(Мс / 1000, "ЧДЦ=2") + " с";
КонецФункции

Процедура ЗаписатьОтчётВФайл(Папка, Текст)
	ЗаписатьОтчётВФайлИмя(Папка, "benchmark_report.txt", Текст);
КонецПроцедуры

Процедура ЗаписатьОтчётВФайлИмя(Папка, ИмяФайла, Текст)
	Попытка
		Запись = Новый ЗаписьТекста(СоединитьПуть(Папка, ИмяФайла), КодировкаТекста.UTF8);
		Запись.Записать(Текст);
		Запись.Закрыть();
	Исключение
		// Файл не критичен - отчёт всё равно возвращается в форму.
	КонецПопытки;
КонецПроцедуры

// Список вариантов числа потоков для сравнения (кривая ускорения).
Функция СписокПотоков()
	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(4);
	Массив.Добавить(8);
	Возврат Массив;
КонецФункции

// Список вариантов размера порции (чанка) для подбора дефолта.
Функция СписокЧанков()
	Массив = Новый Массив;
	Массив.Добавить(25000);
	Массив.Добавить(50000);
	Массив.Добавить(100000);
	Массив.Добавить(200000);
	Массив.Добавить(500000);
	Возврат Массив;
КонецФункции

// Меряет ПАРАЛЛЕЛЬНУЮ выгрузку движком ПереносРегистров при заданном числе потоков.
Функция ЗамерПараллельнойВыгрузки(Папка, ЧислоПотоков, РазмерПорции)

	ОчиститьФайлыПапки(Папка);
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Обработки.БыстрыйПереносРегистров.ВыгрузитьРегистры(СписокРегистра(), Папка, РазмерПорции, ЧислоПотоков);
	Мс = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	Файлов = НайтиФайлы(Папка, "*.bin").Количество();
	Возврат Новый Структура("Мс, Ошибки, Файлов", Мс, "", Файлов);

КонецФункции

Функция СоединитьПуть(Папка, Имя)
	Разделитель = ?(Найти(Папка, "/") > 0, "/", "\");
	Если Прав(Папка, 1) = "\" ИЛИ Прав(Папка, 1) = "/" Тогда
		Возврат Папка + Имя;
	КонецЕсли;
	Возврат Папка + Разделитель + Имя;
КонецФункции

Функция РазмерСтрокой(Байт)
	Если Байт < 1024 Тогда
		Возврат Формат(Байт, "ЧГ=") + " Б";
	ИначеЕсли Байт < 1024 * 1024 Тогда
		Возврат Формат(Байт / 1024, "ЧДЦ=1") + " КБ";
	ИначеЕсли Байт < 1024 * 1024 * 1024 Тогда
		Возврат Формат(Байт / 1024 / 1024, "ЧДЦ=1") + " МБ";
	КонецЕсли;
	Возврат Формат(Байт / 1024 / 1024 / 1024, "ЧДЦ=2") + " ГБ";
КонецФункции

// Шаблон ТЗ той же формы, что РегистрСведений.СинтетическиеДанныеПереноса (для проверки упаковки).
Функция НовыйШаблонТЗ()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Линия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 0)));
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТЗ.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Момент", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Флаг", Новый ОписаниеТипов("Булево"));
	Возврат ТЗ;
КонецФункции

// Пишет порцию двумя способами (A напрямую, B через ХранилищеЗначения) и возвращает время+размер.
Функция ОбработатьПорциюУпаковки(Папка, Номер, ТЗ)

	ПутьA = СоединитьПуть(Папка, "pack_A_" + Строка(Номер) + ".bin");
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗначениеВФайл(ПутьA, ТЗ);
	МсA = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	ФайлA = Новый Файл(ПутьA);
	БайтA = ФайлA.Размер();

	ПутьB = СоединитьПуть(Папка, "pack_B_" + Строка(Номер) + ".bin");
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	// B: ХЗ без явного сжатия (обёртка без deflate).
	ЗначениеВФайл(ПутьB, Новый ХранилищеЗначения(ТЗ));
	МсB = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	ФайлB = Новый Файл(ПутьB);
	БайтB = ФайлB.Размер();

	ПутьC = СоединитьПуть(Папка, "pack_C_" + Строка(Номер) + ".bin");
	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	// C: ХЗ с максимальным deflate (9) - проверяем выигрыш по размеру ради цены CPU.
	ЗначениеВФайл(ПутьC, Новый ХранилищеЗначения(ТЗ, Новый СжатиеДанных(9)));
	МсC = ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт;
	ФайлC = Новый Файл(ПутьC);
	БайтC = ФайлC.Размер();

	Возврат Новый Структура("МсA, БайтA, МсB, БайтB, МсC, БайтC", МсA, БайтA, МсB, БайтB, МсC, БайтC);

КонецФункции

// Читает все порции варианта и меряет время; для B разворачивает ХранилищеЗначения.
Функция ЗамерЧтения(Папка, Префикс, ЧислоПорций, ЧерезХранилище)

	Старт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Строк = 0;
	Для Номер = 0 По ЧислоПорций - 1 Цикл
		Значение = ЗначениеИзФайла(СоединитьПуть(Папка, Префикс + Строка(Номер) + ".bin"));
		Если Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТЗ = ?(ЧерезХранилище, Значение.Получить(), Значение);
		Строк = Строк + ТЗ.Количество();
	КонецЦикла;
	Возврат Новый Структура("Мс, Строк", ТекущаяУниверсальнаяДатаВМиллисекундах() - Старт, Строк);

КонецФункции

#КонецОбласти
